In [2]:
import pandas as pd
df_t = pd.read_csv('data/titanic.csv')
df_t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   adult_male   891 non-null    bool
 10  embark_town  889 non-null    object
dtypes: bool(1), float64(2), int64(4), object(4)
memory usage: 70.6+ KB

In [3]:
df_t.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,embark_town
0,0,3,male,22.0,1,0,7.2500,S,Third,True,Southampton
1,1,1,female,38.0,1,0,71.2833,C,First,False,Cherbourg
2,1,3,female,26.0,0,0,7.9250,S,Third,False,Southampton
3,1,1,female,35.0,1,0,53.1000,S,First,False,Southampton
4,0,3,male,35.0,0,0,8.0500,S,Third,True,Southampton

In [5]:
table = df_t[['sex']].value_counts()
table

sex
male      577
female    314
dtype: int64

In [6]:
len(df_t['sex'])/2

445.5

In [7]:
# 적합도 검정 수행
from scipy.stats import chisquare
chi = chisquare(table, f_exp = [445.5, 445.5])
print(chi)

Power_divergenceResult(statistic=77.63075196408529, pvalue=1.2422095313910336e-18)

In [8]:
table = pd.crosstab(df_t['class'], df_t['survived'])
table

survived    0    1
class
First      80  136
Second     97   87
Third     372  119

In [10]:
from scipy.stats import chi2_contingency

chi, p, df, expect = chi2_contingency(table) # 카이, p-value, 자유도, 독립일 때 예상할 수 있는 기대빈도
print('Statistic:',chi)
print('p-value:',p)
print('df:',df) # (3-1) * (2-1) = 2
print('expect: \n',expect)

Statistic: 102.88898875696056
p-value: 4.549251711298793e-23
df: 2
expect:
 [[133.09090909  82.90909091]
 [113.37373737  70.62626263]
 [302.53535354 188.46464646]]

In [11]:
chi, p, df, expect = chi2_contingency(table)
result = 'chi2 : {}, p-value : {}, df : {}'.format(chi, p, df)
print(result)

chi2 : 102.88898875696056, p-value : 4.549251711298793e-23, df : 2

In [12]:
print(expect)

[[133.09090909  82.90909091]
 [113.37373737  70.62626263]
 [302.53535354 188.46464646]]

In [13]:
table

survived    0    1
class
First      80  136
Second     97   87
Third     372  119

In [14]:
80+97+372

549

In [15]:
136+87+119

342

In [16]:
80+136 # First

216